brew "fd"
brew "fzf"
brew "git"
brew "git-lfs"
brew "go"
brew "golang-migrate"
brew "golangci-lint"
brew "graphviz"
brew "grpcurl"
brew "helm"
brew "jq"
brew "neovim"
brew "protobuf"
brew "ripgrep"
brew "terraform"
brew "watch"
brew "zig"
